---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeThickness
source: html/af429770-e564-7d49-ac0c-925a09e8ced6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded.TopFlangeThickness Property

Top Flange Thickness.

## Syntax (C#)
```csharp
public double TopFlangeThickness { get; set; }
```